index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-19 Fri 00:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0f1acb6">Instruções</a></li>
<li><a href="#org8f5423a">Módulo 1 - Transformação e Conservação de Energia Mecânica</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0f1acb6" class="outline-2">
<h2 id="org0f1acb6">Instruções</h2>
<div class="outline-text-2" id="text-org0f1acb6">
<p>
Os slides das aulas utilizam <a href="https://revealjs.com">reveal.js</a>. Por isso, eles podem não ser
muito intuitivos em seu uso. Sempre que utilizar, clique <code>N</code> para
avançar para o próximo slide, <code>P</code> para retornar ao slide anterior, e
<code>O</code>, para ver a estrutura de slides.
</p>
</div>
</div>
<div id="outline-container-org8f5423a" class="outline-2">
<h2 id="org8f5423a">Módulo 1 - Transformação e Conservação de Energia Mecânica</h2>
<div class="outline-text-2" id="text-org8f5423a">
<p>
<a href="src/aula_setembro_11-12.html">[slides] </a>
</p>

<p>
Nesta aula, estudamos o conceito de <b>Energia Mecânica</b>, soma da energia
potencial com a energia cinética, bem como a transformação de uma em
outra, e possíveis fontes de dissipação envolvidas num sistema de
plano inclinado.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-09-19 Fri 00:06</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
